{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String",
            "metadata": {
                "description": "Log Analytics Workspace Name"
            }
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f3d775a5-b221-462e-9ad9-a439bb9da058')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f3d775a5-b221-462e-9ad9-a439bb9da058')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "File",
            "fieldMappings": [
                {
                    "identifier": "Name",
                    "columnName": "UserId"
                }
            ]
        },
        {
            "entityType": "Account",
            "fieldMappings": [
                {
                    "identifier": "AadUserId",
                    "columnName": "UserId"
                }
            ]
        }
    ],
    "queryFrequency": "PT5H",
    "queryPeriod": "PT5H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Medium",
    "query": "OfficeActivity\r\n| where Operation contains \"file\"\r\n| where SourceFileName contains \"password\"",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "CredentialAccess"
    ],
    "displayName": "AS_0030_PasswordFile",
    "enabled": true,
    "description": "Alerts when documents containing the word password in the file name are in Sharepoint or OneDrive.",
    "alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
