{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String",
            "metadata": {
                "description": "Log Analytics Workspace Name"
            }
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e61141bf-7809-4fae-9806-3344f086f6f9')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e61141bf-7809-4fae-9806-3344f086f6f9')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "Account",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "TargetAccount"
                }
            ]
        },
        {
            "entityType": "Host",
            "fieldMappings": [
                {
                    "identifier": "HostName",
                    "columnName": "Computer"
                }
            ]
        }
    ],
    "queryFrequency": "PT1H",
    "queryPeriod": "PT1H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Medium",
    "query": "SecurityEvent\n| where EventID == 4720",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "Persistence",
        "InitialAccess",
        "Execution"
    ],
    "displayName": "AS_0017_LocalAccountCreated",
    "enabled": true,
    "description": "Alerts when a local account is created. ",
    "alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
